Autodesk.Revit.DB.APIObject.IsReadOnlyInternal
Set the read-only property of this object.

Autodesk.Revit.DB.APIObject.Dispose
Causes the object to release immediately any resources it may be utilizing.
Remarks: This method is usually called implicitly by the programming language when
the object is destroyed. After calling this method the object will no longer work correctly.

Autodesk.Revit.DB.APIObject.IsReadOnly
Identifies if the object is read-only or modifiable.
If true, the object may not be modified.  If false, the object's contents may be modified.

Autodesk.Revit.DB.APIObject
Supports all objects in the Autodesk Revit API hierarchy.